#pragma once


int CheckSystem()
{
	union check
	{
		int i;
		char ch;
	}c;

	c.i = 1;
	
	return (c.ch == 1);
}

void Test()
{
	int check = CheckSystem();
	if (check == 1)
		cout << "当前系统为小端" << endl;
	else
		cout << "当前系统为大端" << endl;
}


///////////////////////////////////////////////////////////////
// 公用的四个字节地址 ：0x1001 0x1002 0x1003 0x1004
 //          赋值1    ：0x01    0x00   0x00   0x00
//也就是说存数据都是从低地址存放 一个char字节，
//他和int开始的地址是一样的 读的话 还是从低字节向高字节完整的读取
////////////////////////////////////////////////////////////////